const database = {
  posts: [
    { id: 0, text: '밥해먹기 귀찮다.', author: '김멋사' },
    { id: 1, text: '임학수 바보', author: '김멋사' },
    { id: 2, text: '살아있는 구글이 여기 있다는데요?', author: '김멋사' },
    { id: 3, text: '저는 네이버에 갈거에요', author: '김멋사' },
    {
      id: 4,
      text: '배민에 취직하면 웰컴키트로 배민 할인쿠폰 준다는데 진짠가요',
      author: '김멋사',
    },
    { id: 5, text: '한조 대기중', author: '배교수' },
    {
      id: 6,
      text: '내가 웹을 배우러 왔지 알고리즘 배우러 왔나',
      author: '배교수',
    },
    { id: 7, text: '출근하기 싫다..', author: '배교수' },
    { id: 8, text: '대표님 월급 좀 올려줘요', author: '배교수' },
    {
      id: 9,
      text: '돈 벌면 마음이 여유로워 진다던데 진짜더라고요 제가 지금 그래요',
      author: '배교수',
    },
  ],
  users: [
    {
      id: 0,
      name: '김멋사',
      info: ['아기사자', '배우고자하는열정'],
    },
    {
      id: 1,
      name: '임대표',
      info: ['낭만', '불광불급'],
    },
    {
      id: 2,
      name: '유살구',
      info: ['코딩믹서기', '멋사큰형'],
    },
    {
      id: 3,
      name: '배교수',
      info: ['한조코딩중', '말투는3G코딩은5G'],
    },
    {
      id: 4,
      name: '김발랄',
      info: ['I를E로바꾸는힘', '못하는게없음'],
    },
    { id: 5, name: '이디짱', info: ['최강디짱', '창조의마술사'] },
    { id: 6, name: '윤람쥐', info: ['든든웹짱', '어화둥둥자존감지킴이'] },
    { id: 7, name: '최깡패', info: ['단단말랑', '코딩집돌이'] },
    { id: 8, name: '조명랑', info: ['분위기메이커', '11기비타민'] },
    { id: 9, name: '김광인', info: ['맑눈광', '노트북사랑맨'] },
  ],
};

export default database;
