/*
    문제3
    - 배열을 요구조건에 출력하세요
    - index와 요소의 차이를 명확하게 구분하는 것이 중요합니다.
*/
const p3 = [10, '999', 2, 3, 5, 9, 12, 100, '2000'];

// 배열 요소를 하나씩 출력하세요. 만약 배열 안에 있는 내용이 문자열일 경우 '~은 문자열입니다!' 를 출력하세요.

// 배열의 요소를 하나씩 출력하는데, *2를 하여 출력하세요. 만약 문자열인 경우 출력하지 마세요.
// for문을 이용해 출력하는 것과 forEach를 이용해 출력하는 것 두 개를 작성하세요

// 배열 안에 요소가 짝수인 것만 출력하세요. 문자열은 경우 숫자로 변환하여 판별하세요.
// for..of를 이용해 출력하는 것과 forEach를 이용해 출력하는 것 두 개를 작성하세요.

// index가 홀수인 것의 요소를 출력하세요.
// for..in을 이용해 출력하는 것과 map을 이용해 출력하는 것 두 개를 작성하세요.

// 숫자형인 모든 요소를 더하고 출력하세요.
// for, for..of, forEach, map을 사용한 코드 각각 하나씩 만드세요

// 문자형인 모든 요소를 더하고 출력하세요.
// for..in으로 만드세요

// 배열을 순회하며 (index * p3[index]) 의 값을 출력하세요
// for..in, map을 사용한 코드 각각 하나씩 만드세요
